--Данные проекта "DonorSearch", цель которого — мотивировать людей становиться донорами
--    и делать регулярные донации. Важно понимать, какие факторы влияют на активность
--    доноров и какими могут быть стратегии для их мотивации.

--Основные задачи:
--    1. Определить регионы с наибольшим количеством зарегистрированных доноров.
--    2. Изучить динамику общего количества донаций в месяц за 2022 и 2023 годы.
--    3. Определить наиболее активных доноров в системе, учитывая только данные
--       о зарегистрированных и подтвержденных донациям.
--    4. Оценить, как система бонусов влияет на зарегистрированные в системе донации.
--    5. Исследовать вовлечение новых доноров через социальные сети, учитывая только
--       тех, кто совершил хотя бы одну донацию. Узнать, сколько по каким каналам пришло
--       доноров, и среднее количество донаций по каждому каналу.
--    6. Сравнить активность однократных доноров со средней активностью повторных доноров.

-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------
--    1. ОПРЕДЕЛИМ РЕГИОНЫ С НАИБОЛЬШИМ КОЛИЧЕСТВОМ ЗАРЕГИСТРИРОВАННЫХ ДОНОРОВ
--Регины с наибольшим количеством зарегистрированных доноров 
SELECT  region,
		COUNT(id) 					
FROM donorsearch.user_anon_data
WHERE region IS NOT NULL          -- учитываем только пользователей указавших регион проживания
GROUP BY region 
ORDER BY COUNT(id) DESC           -- сортировка по убыванию
LIMIT 10                          
;
--------------------------------------------+-----+
--region                                    |count|
--------------------------------------------+-----+
--Россия, Москва                            |37819| *численность населения по данным на 1.01.2024 13.149.803
--Россия, Санкт-Петербург                   |13137| *численность населения по данным на 1.01.2024 5.597.763
--Россия, Татарстан, Казань                 | 6610| *численность населения по данным на 1.01.2024 1.318.604
--Украина, Киевская область, Киев           | 3541|
--Россия, Новосибирская область, Новосибирск| 3310| *численность населения по данным на 1.01.2024 1.633.851
--Россия, Свердловская область, Екатеринбург| 3082| *численность населения по данным на 1.01.2024 1.536.183
--Россия, Башкортостан, Уфа                 | 3014| *численность населения по данным на 1.01.2024 1.163.304
--Россия, Красноярский край, Красноярск     | 2346| *численность населения по данным на 1.01.2024 1.205.473
--Россия, Краснодарский край, Краснодар     | 2186| *численность населения по данным на 1.01.2024 1.138.654
--Россия, Ростовская область, Ростов-на-Дону| 1976| *численность населения по данным на 1.01.2024 1.140.487
--------------------------------------------+-----+
--Регионы с максимальным количеством зарегистрированных доноров - Москва и Санкт-Петербург, что вполне ожидаемо.
--Однако, полезно будет посмотреть какую долю от общей численности занимают зарегистрированные доноры:
--Россия, Москва                            |0,29%
--Россия, Санкт-Петербург                   |0,23%
--Россия, Татарстан, Казань                 |0,50%
--Украина, Киевская область, Киев           | 
--Россия, Новосибирская область, Новосибирск|0,20% 
--Россия, Свердловская область, Екатеринбург|0,20% 
--Россия, Башкортостан, Уфа                 |0,30% 
--Россия, Красноярский край, Красноярск     |0,19% 
--Россия, Краснодарский край, Краснодар     |0,19% 
--Россия, Ростовская область, Ростов-на-Дону|0,17% 

--Как видно, Москва и Санкт-Петербург далеко не на первом месте в этом рейтинге:
--абсолютный лидер Казань 0,5%, потом Уфа 0,3% и Москва 0,29%
--
--Количество зарегистрированных пользователе, не указавших регион проживания в своей анкете
SELECT  COUNT(*) AS no_city_user,
	   (SELECT  COUNT(*) FROM donorsearch.user_anon_data) AS total_user					
FROM donorsearch.user_anon_data
WHERE region IS NULL          
GROUP BY region                            
;
-------------------------+
--no_city_user|total_user|
--------------+----------+
--      100574|    265836|
-------------------------+
--Отсутствуют данные по региону проживания у 100574 человек - это 37,83% от всех зарегистрированных пользователей.
--Это очень большое значение, которое может искажать статистику.
--Рекомендации:
--1. При регистрации на сайте сделать поле в регионом проживания обязательным для заполнения.
--2. Отправить уведомления пользователям с просьбой заполнить анкету полностью.  
-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------


--    2. ИЗУЧИМ ДИНАМИКУ ОБЩЕГО КОЛИЧЕСТВА ДОНАЦИЙ В МЕСЯЦ ЗА 2022 и 2023 ГОДЫ.
WITH
--некорректные даты в таблице с донациями, сортировка по возрастанию дат
tab1 AS(
	SELECT user_id, donation_date,
		   EXTRACT(YEAR FROM donation_date::timestamp) AS donation_year,      --год донации
		   EXTRACT(MONTH FROM donation_date::timestamp) AS donation_month     --номер месяца донации
	FROM donorsearch.donation_anon
	GROUP BY  user_id, donation_date
	ORDER BY donation_date                            --сортировка по дате донации по возрастанию
--user_id|donation_date|donation_year|donation_month|
---------+-------------+-------------+--------------+
-- 131932|   0201-04-27|          201|             4| *некорректная дата 
-- 136722|   0207-05-24|          207|             5| *некорректная дата
-- 119710|   0208-04-21|          208|             4| *некорректная дата
-- 139934|   0214-12-15|          214|            12| *некорректная дата
-- 126057|   1019-11-16|         1019|            11| *некорректная дата
-- 264550|   1900-01-01|         1900|             1| *первое переливание в 1919 году
--   1630|   1919-09-24|         1919|             9|
--   1630|   1920-04-29|         1920|             4|
-- 264550|   1938-07-22|         1938|             7|
-- 119542|   1970-01-01|         1970|             1|
--.................... и т.д. .......................
),
--некорректные даты в таблице с донациями, сортировка по убыванию дат
tab2 AS (
	SELECT user_id, donation_date,
			   EXTRACT(YEAR FROM donation_date::timestamp) AS donation_year,      --год донации
			   EXTRACT(MONTH FROM donation_date::timestamp) AS donation_month     --номер месяца донации
		FROM donorsearch.donation_anon
		GROUP BY  user_id, donation_date
		ORDER BY donation_date DESC                           --сортировка по дате донации по убыванию
----------------------------------------------------+
--user_id|donation_date|donation_year|donation_month|
---------+-------------+-------------+--------------+
-- 147222|   3016-03-28|         3016|             3|*некорректная дата
--   8071|   3013-09-24|         3013|             9|*некорректная дата
-- 262599|   2092-06-10|         2092|             6|*некорректная дата
-- 275398|   2089-05-06|         2089|             5|*некорректная дата
-- 228133|   2085-08-26|         2085|             8|*некорректная дата
-- 161252|   2085-08-07|         2085|             8|*некорректная дата
-- 271511|   2085-08-07|         2085|             8|*некорректная дата
-- 271511|   2056-09-12|         2056|             9|*некорректная дата
-- 271511|   2055-11-30|         2055|            11|*некорректная дата
-- 153753|   2023-11-28|         2023|            11|
-- 259025|   2023-11-28|         2023|            11|
--........................... и т.д. ...............
),
--данные по донациям в 2022 году
tab3 AS(
	SELECT user_id, donation_date,
			EXTRACT(YEAR FROM donation_date::timestamp) AS donation_year,
			EXTRACT(MONTH FROM donation_date::timestamp) AS donation_month
	FROM donorsearch.donation_anon
	WHERE donation_date >= '2022-01-01' AND donation_date <= '2022-12-31'
	GROUP BY  user_id, donation_date
	ORDER BY donation_date
),
--общее число донаций в 2022 году
total_tab3 AS (
	SELECT COUNT(*) AS total 
	FROM tab3
-----------
--total|
-------+
--33376|
--------
),
--распределение донаций в 2022 году
tab3_share AS(
SELECT donation_year,
		   donation_month,
		   COUNT(*),
		   ROUND(COUNT(*)::numeric / 33376 * 100, 2) AS percent_donation
	FROM tab3
	GROUP BY  donation_year, donation_month
	ORDER BY donation_year, donation_month
------------------------------------------------------
--donation_year|donation_month|count|percent_donation|
---------------+--------------+-----+----------------+
--         2022|             1| 1937|            5.80|*минимальное значение
--         2022|             2| 2049|            6.14|
--         2022|             3| 2933|            8.79|
--         2022|             4| 3127|            9.37|
--         2022|             5| 2375|            7.12|
--         2022|             6| 2747|            8.23|
--         2022|             7| 2762|            8.28|
--         2022|             8| 2940|            8.81|
--         2022|             9| 3011|            9.02|
--         2022|            10| 3183|            9.54|
--         2022|            11| 3065|            9.18|
--         2022|            12| 3247|            9.73|* максимальное значение
-----------------------------------------------------+
),
--данные по донациям в 2023 году
tab4 AS(
	SELECT user_id, donation_date,
			EXTRACT(YEAR FROM donation_date::timestamp) AS donation_year,
			EXTRACT(MONTH FROM donation_date::timestamp) AS donation_month
	FROM donorsearch.donation_anon
	WHERE donation_date >= '2023-01-01' AND donation_date <= '2023-12-31'
	GROUP BY  user_id, donation_date
	ORDER BY donation_date
),
--общее число донаций в 2023 году
total_tab4 AS (
	SELECT COUNT(*) AS total 
	FROM tab4
-----------
--total|
-------+
--27380|
--------
),
--распределение донаций в 2023 году
tab4_share AS(
	SELECT donation_year,
		   donation_month,
		   COUNT(*),
		   ROUND(COUNT(*)::numeric / 27380 * 100, 2) AS percent_donation
	FROM tab4
	GROUP BY  donation_year, donation_month
	ORDER BY donation_year, donation_month
------------------------------------------------------
--donation_year|donation_month|count|percent_donation|
---------------+--------------+-----+----------------+
--         2023|             1| 2735|            9.99|
--         2023|             2| 2971|           10.85|
--         2023|             3| 3425|           12.51|*максимальное значение
--         2023|             4| 2868|           10.47|
--         2023|             5| 2479|            9.05|
--         2023|             6| 2583|            9.43|
--         2023|             7| 2225|            8.13|
--         2023|             8| 2359|            8.62|
--         2023|             9| 2188|            7.99|
--         2023|            10| 2066|            7.55|
--         2023|            11| 1481|            5.41|*минимальное значение
------------------------------------------------------
),
--последняя дата донации в 2023 году
tab5 AS (
	SELECT MAX(donation_date)
	FROM donorsearch.donation_anon
	WHERE donation_date >= '2023.11.01' AND  donation_date < '2023.12.01'
-------------
--max       |
------------+
--2023-11-28|
-------------    
)
;           
--В начале 2022 года крайне низкая активность доноров 5,8% от общего количества доноров за весь год.
--В дальнейшем наблюдается увеличение активность. Небольшой спад с мая по август - возможно связано с 
--периодом отпусков. Далее показатель стабилизируется и достигает максимального значения в декабре. 
--
--В начале 2023 года (пик активности в феврале, марте и апреле) продолжает возрастать высокая активность доноров, возможно
--связано с проведение каких-либо агитационных мероприятий. К концу года активность доноров начинает падать и достигает минимума
--в ноябре 5,41% . Можно предположить, что это связано с неполными данными за ноябрь, однако это вряд ли так.
--Данные за ноябрь практически полные, последняя дата донации 28 ноября. Возможно сказывается отсутствие агитации.
--Данных за декабрь нет.
--
--Рекомендации:
-- 1. Отправить уведомления пользователям с просьбой откорректировать даты донаций
-- 2. Проанализировать проводились ли агитационные мероприятия в 2022 году и связано ли это с увеличением
-- активностью доноров к концу года.
-- 3. Проанализировать проводились ли агитационные мероприятия в начале 2023 году и связано ли это с высокой
-- активностью доноров в начале года.
-- 4. Проанализировать проводились ли агитационные мероприятия во второй половине 2023 году и связано ли это
-- со спадом активности доноров.
-- 5. Если пункт  4 подтвердится, проработать мероприятия по привлечению доноров
-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------


-- 3 САМЫЕ АКТИВНЫЕ ДОНОРЫ С ПОДТВЕРЖДЕННЫМИ ДОНАЦИЯМИ.

--ТОП-10 наиболее активных доноров в системе с зарегистрированными и подтвержденными донациями.
SELECT id,
	   donations_before_registration, -- донации до регистрации на сайте, которые подтверждены справками
	   confirmed_donations,           -- подтвержденные донации после регистрации
	   donations_before_registration + confirmed_donations AS total_donation,	-- все подтвержденных донаций
	   whole_blood_count, -- цельная кровь 4 раза в год женщинам, 5 раз в год мужчинам
	   plasma_count,      -- плазму можно сдавать до 20 раз в год
	   platelets_count,   -- тромбоциты до 10 раз в год
	   red_cells_count,   -- эритроциты
	   white_cells_count  -- лейкоциты
FROM donorsearch.user_anon_data
WHERE donations_before_registration + confirmed_donations IS NOT NULL -- уберем пропуски
	  AND (donations_before_registration + confirmed_donations) > 0   -- суммарное количество донаций больше нуля
ORDER BY total_donation DESC                                          -- сортировка по убыванию
LIMIT 10               
----------------------------------------------------------------------------------------------------------------------------------------------------------+
--id    |donations_before_registration|confirmed_donations|total_donation|whole_blood_count|plasma_count|platelets_count|red_cells_count|white_cells_count|
--------+-----------------------------+-------------------+--------------+-----------------+------------+---------------+---------------+-----------------+
--241092|                          667|                  0|           667|                0|           0|              0|              0|                0|
--270870|                          500|                  2|           502|                1|           1|              0|              0|                0|
--273317|                          190|                257|           447|                0|         198|             59|              0|                0|
--201521|                          200|                236|           436|                0|         236|              0|              0|                0|
--267054|                          209|                209|           418|               38|         171|              0|              0|                0|
--204073|                          200|                213|           413|               42|         115|             56|              0|                0|
-- 53912|                          190|                217|           407|               15|         202|              0|              0|                0|
--229012|                          198|                203|           401|               95|         107|              1|              0|                0|
--216353|                          185|                216|           401|               19|         160|             37|              0|                0|
--265938|                          350|                  1|           351|                0|           1|              0|              0|                0|
----------------------------------------------------------------------------------------------------------------------------------------------------------+
--Донор с id 241092 имеет самое большое число донаций 667, причем все они сделаны до регистрации на сайте и
--подтверждены справками.
;

-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------

-- 4. КАК СИСТЕМА БОНУСОВ ВЛИЯЕТ НА ЗАРЕГИСТРИРОВАННЫЕ В СИСТЕМЕ ДОНАЦИИ
--
--Каждая строка в таблице - это какой-то бонус от партнера. ТОП-5 пользователей по количеству полученных бонусов:
SELECT user_id, COUNT(user_id)
FROM donorsearch.user_anon_bonus
GROUP BY user_id
ORDER BY COUNT(user_id) DESC
LIMIT 5
---------------+
--user_id|count|
---------+-----+
-- 150535|   87|
-- 149473|   72|
-- 200221|   51|
-- 185473|   47|
-- 196133|   39|
---------------+
;
--Количество пользователе получивших бонусы
SELECT COUNT(DISTINCT(user_id))
FROM donorsearch.user_anon_bonus
-------+
--count|
-------+
-- 9345|
-------+
--Общее количество все пользователей, зарегистрированных в системе составляет 265836, а количество пользователей,
--получивших бонусы 9345 - это всего лишь 3,5% от общего числа.
;
--Общее количество полученных бонусов
SELECT COUNT(*) AS count_total_bonus
FROM donorsearch.user_anon_bonus
-------------------+
--count_total_bonus|
-------------------+
--            21108|
-------------------+
;

WITH
tabl1 AS(
	SELECT user_id,
		   ROUND(AVG(donation_count)) AS donation_count, --т.к. в каждой записи дублируется суммарное число донаций
		   ROUND(AVG(user_bonus_count)) AS user_bonus_count -- т.к. в каждой записи дублируется общее число бонусов
	FROM donorsearch.user_anon_bonus
	GROUP BY user_id
	-----------------------------------------+
	--user_id|donation_count|user_bonus_count|
	---------+--------------+----------------+
	-- 201521|           236|               7|
	--  53912|           217|               5|
	-- 221198|           195|               1|
	-- 165291|           194|               2|
	-- 122493|           167|               4|
	-- 182697|           166|               8|
	-- 135223|           163|               1|
	-- 233869|           160|               1|
	-- 152002|           159|               9|
	--............. и т.д. ..................
),
--Максимально и минимальное число донаций и бонусов
tabl3 AS (
	SELECT MIN(donation_count) AS min_donation_count,
		   MAX(donation_count) AS max_donation_count,
		   MIN(user_bonus_count) AS min_bonus_count,
		   MAX(user_bonus_count) AS max__bonus_count	
	FROM tabl1
	------------------------------------------------------------------------+
	--min_donation_count|max_donation_count|min_bonus_count|max__bonus_count|
	--------------------+------------------+---------------+----------------+
	--                 0|               236|              1|              87|
	------------------------------------------------------------------------+
--В таблице существуют пользователи с числом донаций 0 
),
--среднее число донаций и бонусов
tabl4 AS(
	SELECT ROUND(AVG(donation_count)) AS avg_donation_count,
		   ROUND(AVG(user_bonus_count)) AS avg_user_bonus_count
	FROM tabl1
	-----------------------------------------+
	--avg_donation_count|avg_user_bonus_count|
	--------------------+--------------------+
	--                 9|                   2|	
	-----------------------------------------+
),
--первоначальное распределение по группам
tabl5 AS (
	SELECT user_id,
		   donation_count, user_bonus_count,
		   CASE 
		   	WHEN donation_count >0 AND donation_count < 50 THEN 'до  50'
		   	WHEN donation_count >=50 AND donation_count < 100 THEN 'до 100'
		   	WHEN donation_count >=100 AND donation_count < 150 THEN 'до 150'
		   	WHEN donation_count >=150 AND donation_count < 200 THEN 'до 200'
		   	WHEN donation_count >=200 AND donation_count < 250 THEN 'до 250'
		   ELSE '0 донаций'
		   	END AS case_donation_count
	FROM tabl1	
),
--агрегация данных для каждой группы
tabl7 AS (	
	SELECT case_donation_count, 
		   COUNT(*) AS count_donor,	   
	       ROUND(AVG(donation_count)) AS avg_donation_count, 
		   MIN(donation_count) AS min_donation_count,
		   MAX(donation_count) AS max_donation_count,
		   ROUND(AVG(user_bonus_count)) AS avg_bonus_count,
		   MIN(user_bonus_count) AS min_bonus_count,
		   MAX(user_bonus_count) AS max__bonus_count
	FROM tabl5
	GROUP BY case_donation_count
	ORDER BY case_donation_count
-------------------------------------------------------------------------------------------------------------------------------------------+
--case_donation_count|count_donor|avg_donation_count|min_donation_count|max_donation_count|avg_bonus_count|min_bonus_count|max__bonus_count|
---------------------+-----------+------------------+------------------+------------------+---------------+---------------+----------------+
--0 донаций          |         42|                 0|                 0|                 0|              2|              1|               5|
--до  50             |       9003|                 7|                 1|                49|              2|              1|              87|
--до 100             |        215|                66|                50|                98|              4|              1|              72|
--до 150             |         70|               117|               100|               149|              4|              1|              29|
--до 200             |         13|               164|               153|               195|              3|              1|              10|
--до 250             |          2|               227|               217|               236|              6|              5|               7|
),
--имеет смысл уменьшить количество групп до трех
tabl8 AS (	
	SELECT user_id,
		   donation_count, user_bonus_count,
		   CASE 
		   	WHEN donation_count >0 AND donation_count < 100 THEN 'до 100'
		   	WHEN donation_count >=100 AND donation_count < 250 THEN 'до 250'
   		    ELSE '0 донаций'
		   	END AS case_donation_count
	FROM tabl1
),
tabl9 AS (SELECT case_donation_count, 
		   COUNT(*),	   
	       ROUND(AVG(donation_count)) AS avg_donation_count, 
		   MIN(donation_count) AS min_donation_count,
		   MAX(donation_count) AS max_donation_count,
		   ROUND(AVG(user_bonus_count)) AS avg_bonus_count,
		   MIN(user_bonus_count) AS min_bonus_count,
		   MAX(user_bonus_count) AS max__bonus_count
	FROM tabl8
	GROUP BY case_donation_count
-------------------------------------------------------------------------------------------------------------------------------------
--case_donation_count|count|avg_donation_count|min_donation_count|max_donation_count|avg_bonus_count|min_bonus_count|max__bonus_count|
---------------------+-----+------------------+------------------+------------------+---------------+---------------+----------------+
--до 250             |   85|               127|               100|               236|              4|              1|              29|
--до 100             | 9218|                 8|                 1|                98|              2|              1|              87|
--0 донаций          |   42|                 0|                 0|                 0|              2|              1|               5|
-------------------------------------------------------------------------------------------------------------------------------------
),
--общая таблица с id пользоватей получивших бонусы и id всех зарегистрированных пользователей на сайте
tabl11 AS (
	SELECT tabl10.id AS user_id,
	   COALESCE(tabl1.donation_count,0) AS donation_count, -- донации, участвующие в бонусной программе
	   COALESCE(tabl1.user_bonus_count,0) AS user_bonus_count,  -- количество бонусов 
	   tabl10.confirmed_donations AS confirmed_donations
FROM donorsearch.user_anon_data AS tabl10
LEFT JOIN tabl1 ON tabl10.id = tabl1.user_id 
),
--доноры, использующие бонусы
tabl12 AS (
	SELECT COUNT(*) AS всего_доноров,
		   SUM(confirmed_donations) AS всего_донаций,
	       ROUND(AVG(confirmed_donations), 2) AS ср_знач_донаций,
	       sum(user_bonus_count) AS всего_бонусов,
	       ROUND(AVG(user_bonus_count), 2) AS ср_знач_бонусов
	FROM tabl11
	WHERE user_bonus_count > 0 
---------------------------------------------------------------------------+	
--всего_доноров|всего_донаций|ср_знач_донаций|всего_бонусов|ср_знач_бонусов|
---------------+-------------+---------------+-------------+---------------+
--         9345|        88210|           9.44|        21108|           2.26|
---------------------------------------------------------------------------+
),
--доноры не использующие бонусы
tabl13 AS (
	SELECT COUNT(*) AS всего_доноров,
		   SUM(confirmed_donations) AS всего_донаций,
	       ROUND(AVG(confirmed_donations), 2) AS ср_знач_донаций,
	       sum(user_bonus_count) AS всего_бонусов,
	       ROUND(AVG(user_bonus_count), 2) AS ср_знач_бонусов
	FROM tabl11
	WHERE user_bonus_count = 0
---------------------------------------------------------------------------+
--всего_доноров|всего_донаций|ср_знач_донаций|всего_бонусов|ср_знач_бонусов|
---------------+-------------+---------------+-------------+---------------+
--       256491|       134667|           0.53|            0|           0.00|
---------------------------------------------------------------------------+
),
--доноры, сделавшие хотябы 1 донацию и не использующие бонусы
tabl14 AS (
	SELECT COUNT(*) AS всего_доноров,
		   SUM(confirmed_donations) AS всего_донаций,
	       ROUND(AVG(confirmed_donations), 2) AS ср_знач_донаций,
	       sum(user_bonus_count) AS всего_бонусов,
	       ROUND(AVG(user_bonus_count), 2) AS ср_знач_бонусов
	FROM tabl11
	WHERE user_bonus_count = 0 AND confirmed_donations!=0
)
SELECT 'используют' AS бонусы, *
FROM tabl12
UNION ALL
SELECT 'не исп. и кол-во донаций >0' AS бонусы, *
FROM tabl14
UNION ALL
SELECT 'не используют' AS бонусы, *
FROM tabl13
;
-------------------------------------------------------------------------------------------------------+
--бонусы                     |всего_доноров|всего_донаций|ср_знач_донаций|всего_бонусов|ср_знач_бонусов|
-----------------------------+-------------+-------------+---------------+-------------+---------------+
--используют                 |         9345|        88210|           9.44|        21108|           2.26|
--не исп. и кол-во донаций >0|        29308|       134667|           4.59|            0|           0.00|
--не используют              |       256491|       134667|           0.53|            0|           0.00|
-------------------------------------------------------------------------------------------------------+
--Всего 9345 доноров пользуются бонусами - 31,89% от числа пользователей, совершивших хотя бы одну донацию,
--и лишь 3,5%  от общего числа зарегистрированных в системе пользователей (265836 чел).
--Из них 42 человека пользуются бонусами, однако имеют число донаций 0
--БОльшая часть пользователей, использующих бонусы, имеет до 100 донаций:
--   9218 человек,
--   среднее количество донаций 8,
--   использовали в среднем 2 бонуса, при этом максимум 87 
--Незначительная часть пользователей, использующих бонусы, имеют от 100 до 250 донаций:
--   85 человек, 
--   среднее количество донаций 127,
--   использовали в среднем 4 бонуса, при этом максимум 29 
--Пользователи использующие бонусы в среднем совершили 9,44 донации.
--
--Пользователей совершивших хотя бы одну донацию и не использующие бонусы 29308 человек - это 11,43%
--от общего числа зарегистрированных в системе пользователей (265836 чел). Эти пользователи в 2 раза
--реже совершают донации, в среднем  4,59 раза.
--
--Выводы:
--1. Первое, что стоит отметить, это большое количество пользователей зарегистриованных на сайте,
--но не совершивших ни одной донации - 256491 человек..
--   Возможно они были участниками какой-либо акции и получали какие-то призы/подарки и т.д. за
--   регистрацию на сайте, а становитьс донорами не планировали.
--   Возможно это новые пользователи, которые недавно зарегистрировались и еще не успели стать донором.
--   Возможно по каким-то причинам эти пользователи не могут подтвердить свои донации.
--2.  Второе, почему пользователи являющиеся донорами с подтвержденными донациями не используют
--бонусы?
--    Возможно не интересные бонусы от партнеров, возможно в регионе проживания доноров нет возможности
--    использовать эти бонусы, возможно для получения более сушественных бонусов необходимо
--    определенное количество донаций
--
-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------


-- 5. ИССЛЕДОВАНИЕ СОЦИАЛЬНЫХ СЕТЕЙ, КОТОРЫЕ ПРЕДПОЧИТАЮТ ДОНОРЫ 

--   Будем учитывать только тех, кто совершил хотя бы одну донацию.
--   Узнать, сколько по каким каналам пришло доноров, и среднее количество донаций по каждому каналу.
--   
	SELECT autho_vk, autho_ok, autho_tg, autho_yandex, autho_google
	FROM donorsearch.user_anon_data
	ORDER BY autho_vk DESC, autho_ok DESC, autho_tg DESC, autho_yandex DESC, autho_google DESC
	LIMIT 5
------------------------------------------------------+
--autho_vk|autho_ok|autho_tg|autho_yandex|autho_google|
----------+--------+--------+------------+------------+
--true    |true    |true    |true        |true        |
--true    |true    |true    |true        |true        |
--true    |true    |true    |true        |true        |
--true    |true    |true    |true        |true        |
--true    |true    |true    |true        |true        |
------------------------------------------------------+
--Сортировка по убыванию помогает убедиться, что один пользователь может указать несколько соцсетей
;

WITH
table1 AS (
	SELECT id, autho_vk, autho_ok, autho_tg, autho_yandex, autho_google, donations_before_registration, confirmed_donations
	FROM donorsearch.user_anon_data
),
--Количество зарегистрированных пользователе, не указавших хотя бы одну соцсеть в своей анкете
table2 AS (
			SELECT 'не указана' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_vk = 'false' AND autho_ok= 'false' AND autho_tg = 'false' AND autho_yandex = 'false'
			AND autho_google = 'false'
),
--Количество пользователей указавших вконтакте
table3 AS (
			SELECT 'Вконтакте' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_vk = 'true'
),
--Количество пользователей указавших одноклассники
table4 AS (
			SELECT 'Одноклассники' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_ok = 'true'
),
--Количество пользователей указавших телеграм
table5 AS (
			SELECT 'Телеграм' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_tg = 'true'
),
--Количество пользователей указавших яндекс
table6 AS (
			SELECT 'Яндекс' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_yandex = 'true'
),
--Количество пользователей указавших гугл
table7 AS (
			SELECT 'Google' AS social_media, COUNT(*) AS count_user,
			ROUND(AVG(donations_before_registration), 2) AS avg_donations_before_registration,
			ROUND(AVG(confirmed_donations), 2) AS avg_donations_after_registration,
			ROUND(AVG(donations_before_registration + confirmed_donations), 2) AS avg_count_donations
			FROM table1
			WHERE autho_google = 'true'
)
SELECT * FROM table2
UNION ALL
SELECT * FROM table3
UNION ALL
SELECT * FROM table4
UNION ALL
SELECT * FROM table5
UNION ALL
SELECT * FROM table6
UNION ALL
SELECT * FROM table7
-----------------------------------------------------------------------------------------------------------------+
--social_media |count_user|avg_donations_before_registration|avg_donations_after_registration|avg_count_donations|
---------------+----------+---------------------------------+--------------------------------+-------------------+
--не указана   |    113266|                            13.84|                            0.71|              19.59|
--Вконтакте    |    127254|                            13.67|                            0.91|              24.59|
--Одноклассники|      7766|                            22.59|                            1.72|              44.27|
--Телеграм     |       890|                            17.69|                            4.32|              47.18|
--Яндекс       |      5170|                            13.19|                            3.90|              25.83|
--Google       |     16485|                            12.76|                            2.22|              21.10|
-----------------------------------------------------------------------------------------------------------------+
--Самая популярная социальная сеть среди пользователей сайта - это Вконтакте, ее указали в анакете 127254 человека,
--что составляет 47,87% от общего числа зарегистрированных пользователей (265836 человек). Эти пользователи до
--регистрации показывали хорошую активность, среднее количество донаций 13,67, а вот после регистрации их активность
--резко упала до среднего значения донаций всего 0,91.
--Самая непопулярная социальная сеть это Телеграм, ее указали в анкете только 890 человек, что составляет 0,33% от 
--общего числа пользователей. Однако именно эти пользователи имеют высокую активность как до регистрации, так и после.
--Среднее количество донаций до регистрации 17,69, а среднее количество донаций после регистрации 4,32 - эта
--миксимальное значение по группам.
--  
;

-- Количество пользователей указавших 1, 2, 3, 4 или 5 соцсетей в анкете
WITH
table8 AS (
	SELECT id, autho_vk, autho_ok, autho_tg, autho_yandex, autho_google, donations_before_registration, confirmed_donations
	FROM donorsearch.user_anon_data
),
--добавление дополнительного столбца с количеством указанных соцсетей 
table9 AS (
	SELECT id,
	CASE WHEN autho_vk = 'true' THEN '1' ELSE '0' END AS autho_vk,
	CASE WHEN autho_ok = 'true' THEN '1' ELSE '0' END AS autho_ok,
	CASE WHEN autho_tg = 'true' THEN '1' ELSE '0' END AS autho_tg,
	CASE WHEN autho_yandex = 'true' THEN '1' ELSE '0' END AS autho_yandex,
	CASE WHEN autho_google = 'true' THEN '1' ELSE '0' END AS autho_google,
	CAST(autho_vk AS INTEGER) + CAST(autho_ok AS INTEGER)+ CAST(autho_tg AS INTEGER)
	    + CAST(autho_yandex AS INTEGER)+ CAST(autho_google AS INTEGER) AS count_social_media
	FROM table8
	ORDER BY count_social_media DESC
	--id    |autho_vk|autho_ok|autho_tg|autho_yandex|autho_google|count_social_media|
	--------+--------+--------+--------+------------+------------+------------------+
	--186680|1       |1       |1       |1           |1           |                 5|
	--160109|1       |1       |1       |1           |1           |                 5|
	--210905|1       |1       |1       |1           |1           |                 5|
	--188102|1       |1       |1       |1           |1           |                 5|
	--168321|1       |1       |1       |1           |1           |                 5|
	--............................... и т.д. .........................................
)
SELECT count_social_media, COUNT(*)
FROM table9
GROUP BY count_social_media
ORDER BY count_social_media
---------------------------+
--count_social_media|count |
--------------------+------+
--                 0|113266|
--                 1|148655| это 55,9se2% от общего числа зарегистрированных пользователей
--                 2|  3054| это 1,15% от общего числа зарегистрированных пользователей
--                 3|   686| это 0,26% от общего числа зарегистрированных пользователей
--                 4|   131| это 0,05% от общего числа зарегистрированных пользователей
--                 5|    44| это 0,02% от общего числа зарегистрированных пользователей
---------------------------+
-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------

--    6. Активность повторных доновор.
--
--Количество строк в таблице = количество донаций
SELECT COUNT(*)			
FROM donorsearch.donation_anon
--------+
--count |
--------+
--245744|
--------+

--Проверка на наличие неявных дубликатов когда совпадают все поля кроме id. 
SELECT user_id, blood_class, donation_date, plan_date, donation_type, city,	
       region, country, donation_place, confirmation, donation_added_date,
       donation_status, COUNT(*)			
FROM donorsearch.donation_anon
GROUP BY  user_id, blood_class, donation_date, plan_date, donation_type, city,	
       region, country, donation_place, confirmation, donation_added_date,
       donation_status
HAVING COUNT(*) > 1 
ORDER BY COUNT(*) DESC                   
LIMIT 10                               
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--user_id|blood_class  |donation_date|plan_date|donation_type|city           |region                                     |country|donation_place                                                                |confirmation|donation_added_date|donation_status|count|
---------+-------------+-------------+---------+-------------+---------------+-------------------------------------------+-------+------------------------------------------------------------------------------+------------+-------------------+---------------+-----+
-- 211970|Плазма       |   2010-03-13|         |Безвозмездно |Иркутск        |Иркутская область                          |Россия |ГУЗ "Иркутская областная станция переливания крови"                           |true        |         2022-08-01|Принята        |  208|
-- 267054|Плазма       |   2008-08-16|         |Безвозмездно |Сызрань        |Самарская область                          |Россия |ГБУЗ "Самарская областная клиническая СПК", отделение в г.о. Сызрань          |true        |         2023-09-05|Принята        |  170|
-- 224103|Плазма       |   2017-06-12|         |Безвозмездно |Калининград    |Калининградская область                    |Россия |ГУЗ "Калининградская областная станция переливания крови"                     |true        |         2022-10-05|Принята        |  144|
-- 235987|Цельная кровь|   2007-04-12|         |Безвозмездно |Димитровград   |Ульяновская область                        |Россия |ФГБУЗ Клиническая больница №172 ФМБА России Центр крови                       |true        |         2023-03-18|Принята        |  139|
-- 246984|Плазма       |   2010-04-13|         |Безвозмездно |Омск           |Омская область                             |Россия |Центр крови Омской области                                                    |true        |         2023-03-15|Принята        |  134|
--   5337|Плазма       |   2006-08-10|         |Безвозмездно |Усть-Илимск    |Иркутская область                          |Россия |Филиал № 5 ГБУЗ "Иркутская областная станция переливания крови" г. Усть-Илимск|true        |         2022-09-29|Принята        |  130|
-- 201521|Плазма       |   2021-07-16|         |Платно       |Иваново        |Ивановская область                         |Россия |Ивановская областная станция переливания крови                                |true        |         2022-08-07|Принята        |  129|
-- 165291|Плазма       |   2016-09-10|         |Безвозмездно |Липецк         |Липецкая область                           |Россия |ГУЗ "Липецкая областная станция переливания крови"                            |true        |         2023-01-11|Принята        |  125|
-- 233686|Плазма       |   2006-01-30|         |Безвозмездно |Нижневартовск  |Ханты-Мансийский Автономный округ - Югра АО|Россия |КУ ХМАО - Югры "Станция переливания крови", филиал в г. Нижневартовске        |true        |         2023-01-09|Принята        |  124|
-- 105883|Плазма       |   2006-09-14|         |Безвозмездно |Нижний Новгород|Нижегородская область                      |Россия |Нижегородский областной центр крови им. Н.Я. Климовой                         |true        |         2022-09-28|Принята        |  111|
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--Таблица содержит большое количество полность одинаковых строк, которым присвоены разные id
;
--Возможные варианты статусов
SELECT donation_status
FROM donorsearch.donation_anon
GROUP BY donation_status
-----------------+
--donation_status|
-----------------+
--Без справки    |
--На модерации   |
--Отклонена      |
--Принята        |
--Удалена        |
-----------------+
--Для дальнейших расчетов потребуются только донации со статусом ПРИНЯТА 
;

WITH 
--таблица после удаления неявных дубликатов, когда совпадают все поля кроме id:
t1 AS (
	SELECT MIN(id) AS id,                                                       --за id берется минимальное значение
		   user_id, blood_class, donation_date, plan_date, donation_type, city,	
           region, country, donation_place, confirmation, donation_added_date,
           donation_status			
	FROM donorsearch.donation_anon
	GROUP BY  user_id, blood_class, donation_date, plan_date, donation_type, city,	
              region, country, donation_place, confirmation, donation_added_date,
              donation_status
),
count_t1 AS (
	SELECT COUNT(*)
	FROM t1
	--count |
	--------+
	--226229| * удалено 19515 строки из первоначальной таблицы: 245744-226229=19515
),
--донации только со статусом "принята"
t2 AS (
	SELECT id, user_id, blood_class, donation_date, plan_date, donation_type, city,	
       region, country, donation_place, confirmation, donation_added_date,
       donation_status
	FROM t1
	WHERE donation_status = 'Принята'
),
--количество донаций со статусом "принята"
count_t2 AS (
	SELECT COUNT(*)
	FROM t2
	---------
	--count |
	--------+
	--202681| * удалено 43063 строки из первоначальной таблицы: 245744-202681=43063
	--------+
),
--добавление id записи
t2_new AS (
SELECT t1.id ,--AS id,
	   t2.user_id ,--AS user_id,
	   t2.blood_class, --AS blood_class,
	   t2.donation_date, --AS donation_date,
	   t2.plan_date ,--AS plan_date,
	   t2.donation_type, --AS donation_type,
	   t2.city ,--AS city,	
       t2.region ,--AS region,
       t2.country,-- AS country,
       t2.donation_place,-- AS donation_place,
       t2.confirmation ,--AS confirmation,
       t2.donation_added_date ,--AS donation_added_date,
       t2.donation_status --AS donation_status
	FROM t2
	LEFT JOIN t1 ON t2.user_id = t1.user_id
		AND t2.blood_class = t1.blood_class	
		AND t2.donation_date = t1.donation_date
		AND t2.plan_date = t1.plan_date
		AND t2.donation_type = t1.donation_type
		AND t2.city = t1.city
		AND t2.region = t1.region
		AND t2.country = t1.country
		AND t2.donation_place = t1.donation_place
		AND t2.confirmation = t1.confirmation
        AND t2.donation_added_date = t1.donation_added_date
		AND t2.donation_status = t1.donation_status
),
--В поле с датами донаций есть аномальные даты до 1919-09-24 и после  2023-11-28
t10 AS (
	SELECT *
	FROM t2_new
	WHERE donation_date >= '1919-09-24' AND  donation_date <= '2023-11-28'
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
--id    |user_id|blood_class  |donation_date|plan_date |donation_type|city     |region            |country|donation_place                                          |confirmation|donation_added_date|donation_status|
--------+-------+-------------+-------------+----------+-------------+---------+------------------+-------+--------------------------------------------------------+------------+-------------------+---------------+
--130803| 187131|Цельная кровь|   2022-08-11|2022-06-21|Безвозмездно |Москва   |Не указан         |Россия |ФГБУ НМИЦ Гематологии, (бывш. ГНЦ)                      |true        |         2022-08-15|Принята        |
--121572| 154810|Цельная кровь|   2022-06-10|2022-05-03|Безвозмездно |Киров    |Кировская область |Россия |Кировский центр крови                                   |true        |         2022-06-16|Принята        |
-- 95847| 142147|Цельная кровь|   2021-03-19|2021-02-16|Безвозмездно |Краснодар|Краснодарский край|Россия |ГУЗ "Краевая КБ №1 им. проф. С.В.Очаповского", опк      |true        |         2021-03-19|Принята        |
--131139| 205051|Цельная кровь|   2022-08-03|2022-08-03|Безвозмездно |Москва   |Не указан         |Россия |ГКБ № 67 им. Л.А.Ворохобова, отделение переливания крови|true        |         2022-08-19|Принята        |
--132525| 193911|Цельная кровь|   2022-07-25|2022-07-22|Безвозмездно |Уфа      |Башкортостан      |Россия |ГБУЗ "Республиканская станция переливания крови"        |true        |         2022-08-29|Принята        |
--------------- и т.д. ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
),
--Количество донаций, период донации и средний промежуток между донациями каждого пользователя
t11 AS (
	SELECT user_id, COUNT(*) AS донаций,
			MAX(donation_date) - MIN(donation_date)  AS дней_донации,
			(MAX(donation_date) - MIN(donation_date)) / COUNT(*) AS средний_интервал_между_донациями
	FROM t10
	GROUP BY user_id
	---------------------------------------------------------------+
	--user_id|донаций|дней_донации|средний_интервал_между_донациями|
	---------+-------+------------+--------------------------------+
	--      7|      1|           0|                               0|
	--      8|      3|         126|                              42|
	--     11|      5|        1505|                             301|
	--     14|     12|        1052|                              87|
	--     18|      1|           0|                               0|
	------------ и т.д. -------------------------------------------+
),
--Присвоение категорий по количеству донаций
t12 AS (
	SELECT *,
	CASE 
		WHEN донаций BETWEEN 0 AND 10 THEN 'до 10 донаций'
		WHEN донаций BETWEEN 11 AND 25 THEN 'до 25 донаций'
		WHEN донаций BETWEEN 26 AND 50 THEN 'до 50 донаций'
		ELSE 'от 51'
	END AS категории
	FROM t11
)
SELECT категории, COUNT(user_id), ROUND(AVG(донаций), 2) AS среднее_число_донаций,
		ROUND(AVG(дней_донации) / 365, 2) AS ср_знач_периода_донации_год,
		ROUND(AVG(средний_интервал_между_донациями)/12, 2) AS сз_знач_интервал_донации_мес
FROM t12
GROUP BY категории
ORDER BY категории 
----------------------------------------------------------------------------------------------------+
--категории    |count|среднее_число_донаций|ср_знач_периода_донации_год|сз_знач_интервал_донации_мес|
---------------+-----+---------------------+---------------------------+----------------------------+
--до 10 донаций|33982|                 2.24|                       0.71|                        5.38|
--до 25 донаций| 2830|                17.17|                       6.05|                       10.86|
--до 50 донаций| 1325|                35.10|                       9.18|                        8.12|
--от 51        |  398|                78.95|                      12.06|                        4.89|
----------------------------------------------------------------------------------------------------+
;
